
from magtifun_oop import MagtiFun
# from info import username, password

username = "თქვენი ტელეფონის ნომერი"
password = "თქვენი პაროლი"

#############################################
######## გამოყენების მოკლე მაგალითი #########
#############################################
s = MagtiFun(username, password)
s.login()
s.send_messages("591012340", "შენც შეგიძლია!")
# შეტყობინების გაგზავნის შემდეგ აუცილებლად შეამოწმეთ log-ის ფაილი.


#############################################
###############  უფრო ვრცლად  ###############
#############################################

# # 1 შეტყობინების გასაგზავნად numbers და messages მნიშვნელობების მაგალითი 1
# numbers, messages = "591012340" , "სალამი მაგთიფანიდან"

# # 1 შეტყობინების გასაგზავნად numbers და messages მნიშვნელობების მაგალითი 2
# numbers, messages = ["591012340"] , ["სალამი მაგთიფანიდან"]

# # რამდენიმე შეტყობინების გასაგზავნად numbers და messages მნიშვნელობების მაგალითი 1
# # (ყველა შეტყობინება გაიგზავნება)
# numbers = ["591012340" for i in range(30)]
# messages = [f"ისწავლე პროგრამირება ({i+1})" for i in range(30)]

# # რამდენიმე შეტყობინების გასაგზავნად numbers და messages მნიშვნელობების მაგალითი 2
# # (შეტყობინებათა ნაწილი არ გაიგზავნება)
# numbers = [username * 10, username, username]
# messages = ["", "ეს შეტყობინება არ გაიგზავნება" * 100, "+1" ]


# s = MagtiFun(username, password)

# if s.login():
#     print("წარმატებული ავტორიზაცია")

#     # s.get_balance(); print("ბალანსი:", s.balance)

#     if s.send_messages(numbers, messages):
#         print("ყველა შეტყობინება წარმატებით გაიგზავნა")
#     else:
#         print("ზოგიერთი შეტყობინება ვერ გაიგზავნა, შეამოწმე log-ის ფაილი")
# else:
#     print("წარუმატებელი ავტორიზაცია")

